[
  {
    "id": "0a432495-4bcf-4146-952f-ba6ee263c44c",
    "name": "Dumbbell Shrugs",
    "description": "Stand upright with a dumbbell in each hand, arms fully extended at your sides, and palms facing your body. Keep your chest lifted, shoulders pulled slightly back, and core engaged. Without bending your elbows, lift your shoulders straight up toward your ears as high as you can. Focus on contracting your trapezius muscles at the top of the movement. Pause briefly, then slowly lower your shoulders back down under control. Avoid rolling or rotating the shoulders — the motion should be vertical and controlled.",
    "muscleGroup": "Trapezius",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_SHRUGS"
  },
  {
    "id": "e51e9549-d9b7-463e-a8e2-19b3d00ee8af",
    "name": "Barbell Shoulder Press",
    "description": "Stand tall with your feet shoulder-width apart and a barbell resting at shoulder level, palms facing forward and elbows slightly in front of the bar. Engage your core and retract your shoulder blades. Press the barbell upward in a straight line until your arms are fully extended above your head without locking the elbows. At the top, keep the bar slightly behind your head for proper alignment. Lower the barbell back to shoulder level with control. Keep your torso upright throughout the movement and avoid leaning back.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "BARBELL_SHOULDER_PRESS"
  },
  {
    "id": "719744b2-7c47-4224-916f-45d08d59175f",
    "name": "Cable Lateral Raise",
    "description": "Set the cable pulley to the lowest position and attach a single handle. Stand sideways to the machine, holding the handle with the hand farthest from the pulley. Let your arm rest alongside your body with a slight bend in the elbow. Engage your core and raise your arm out to the side until it reaches shoulder height, keeping the movement slow and controlled. Pause briefly at the top, then lower the handle back to the starting position. Keep your torso still and avoid swinging. Repeat the movement on the opposite side.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "CABLE_LATERAL_RAISE"
  },
  {
    "id": "07e4e1b2-e5b1-4d5e-b211-e6879f618a04",
    "name": "Upright Row",
    "description": "Stand upright holding a barbell with a narrow, overhand grip at hip level. Keep your back straight, chest up, and core engaged. Pull the barbell straight up along your body, leading with your elbows and keeping the bar close to your torso. Raise the bar until it reaches upper chest or neck level, with elbows flaring outward and positioned above the wrists. Pause briefly at the top, then lower the bar slowly and under control back to the starting position. Avoid swinging or using momentum throughout the movement.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "UPRIGHT_ROW"
  },
  {
    "id": "04a477b1-e17d-445a-9669-5607f1e3c5b6",
    "name": "Front Raise with Dumbbells",
    "description": "Stand upright with a dumbbell in each hand, arms extended down in front of your thighs, and palms facing your body. Keep your chest lifted, shoulders relaxed, and engage your core. Raise one or both arms straight in front of you until they reach shoulder height, keeping your elbows slightly bent and wrists neutral. Pause briefly at the top to contract your shoulder muscles. Lower the dumbbells slowly and under control back to the starting position. Avoid using momentum or swinging your body during the movement.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "FRONT_RAISE_WITH_DUMBBELLS"
  },
  {
    "id": "f737837d-22ac-4fa1-bb9c-5724e5c14512",
    "name": "Dumbbell Shoulder Press",
    "description": "Sit on a bench with back support and hold a dumbbell in each hand resting on your thighs. Using your legs, help lift the dumbbells up to shoulder height, elbows bent and palms facing forward. Press the dumbbells upward until your arms are fully extended above your head, bringing the weights slightly together at the top without locking your elbows. Lower the dumbbells in a controlled manner back to shoulder level. Keep your core tight and avoid arching your back. This exercise can also be performed standing, but requires strict posture and core engagement.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_SHOULDER_PRESS"
  },
  {
    "id": "1548269e-bf89-4902-bf57-d988a1b4500d",
    "name": "Lateral Raise with Dumbbells",
    "description": "Stand upright with a dumbbell in each hand, arms relaxed at your sides, and palms facing your body. Engage your core and keep your chest lifted. With a slight bend in your elbows, raise both arms out to the sides until they reach shoulder height, keeping the motion smooth and controlled. Pause briefly at the top while contracting your shoulder muscles. Lower the dumbbells slowly back to the starting position. Avoid swinging or using momentum. This exercise can also be performed seated for greater isolation.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "LATERAL_RAISE_WITH_DUMBBELLS"
  },
  {
    "id": "04797c93-3325-4f79-9d30-7d56348796ca",
    "name": "Arnold Dumbbell Press",
    "description": "Sit on a bench with back support, holding a dumbbell in each hand resting on your thighs. Lift the dumbbells to chest level with your palms facing your body and elbows bent in front of you. Begin the press by rotating your wrists outward as you press the weights overhead. At the top of the movement, your arms should be fully extended and your palms facing forward. Reverse the motion as you lower the dumbbells, rotating your wrists back inward to return to the starting position. Keep your core tight and perform the movement in a smooth and controlled manner.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "ARNOLD_DUMBBELL_PRESS"
  },
  {
    "id": "f75fb129-1f8d-4d11-96b3-02874c0c0833",
    "name": "Leg curl",
    "description": "Lie face down on the machine and place your feet under the pad, positioning it just above your heels. Grab the handles in front of you. Contract your hamstrings to bring the pad closer to your glutes. Slowly lower the weight back to the starting position without fully locking your knees, and repeat. This exercise can also be performed unilaterally, one leg at a time.",
    "muscleGroup": "Hamstrings",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "LEG_CURL"
  },
  {
    "id": "e7794d4f-7a83-4d59-8674-defb984bc750",
    "name": "Cable Front Raise",
    "description": "Set the cable pulley to the lowest position and attach a single handle. Stand facing away from the machine with the handle held in one hand, arm resting alongside your body and palm facing your thigh. Engage your core and raise your arm straight in front of you to shoulder height, keeping your elbow slightly bent and wrist neutral. Pause briefly at the top, then slowly lower the handle back to the starting position with control. Avoid using momentum or leaning backward. Repeat the same motion with the other arm.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "CABLE_FRONT_RAISE"
  },
  {
    "id": "7bbceac2-84db-4312-b0e0-ef8b09ccf2ba",
    "name": "Reverse Fly on Incline Bench",
    "description": "Lie face down on an incline bench with a dumbbell in each hand, arms extended toward the floor and palms facing each other. Keep your chest in contact with the bench and engage your core. With a slight bend in the elbows, raise your arms out to the sides in a wide arc until they reach shoulder height. Focus on squeezing the shoulder blades together at the top. Lower the dumbbells slowly and under control back to the starting position. Avoid using momentum or swinging the arms.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "REVERSE_FLY_ON_INCLINE_BENCH"
  },
  {
    "id": "2f8f829a-d9d7-4103-ad18-cbfce8acb090",
    "name": "Cable Reverse Fly",
    "description": "Stand facing the cable machine with both pulleys set at the highest position. Grab the left handle with your right hand and the right handle with your left hand, so that your arms are crossed in front of you with elbows slightly bent and hands just below shoulder height. Engage your core and pull both arms out and back in a wide arc until your hands are aligned with your shoulders and your arms are perpendicular to your torso. Focus on contracting the rear delts at the peak of the movement. Slowly return to the starting crossed-arm position with control, avoiding momentum or using your back.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "CABLE_REVERSE_FLY"
  },
  {
    "id": "33de4217-b37f-469f-b135-0be975053423",
    "name": "Dumbbell Biceps Curl",
    "description": "Stand upright with a dumbbell in each hand, arms fully extended at your sides and palms facing forward. Keep your elbows close to your torso and your back straight. Curl the dumbbells upward by flexing your elbows, bringing the weights toward your shoulders while keeping your upper arms stationary. Focus on contracting your biceps at the top of the movement. Lower the dumbbells slowly back to the starting position without locking your elbows completely. This exercise can also be performed seated on a bench.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_BICEPS_CURL"
  },
  {
    "id": "90492bc2-1804-4a68-8179-cf62b2807f21",
    "name": "Barbell Curl",
    "description": "Stand upright holding a barbell with both hands using a shoulder-width underhand grip, palms facing forward. Let your arms hang fully extended in front of your thighs. Keep your elbows close to your torso and curl the barbell upward by flexing your elbows, bringing the bar toward your shoulders. Focus on keeping your upper arms stationary and avoid swinging. Squeeze the biceps at the top, then lower the barbell in a controlled manner back to the starting position without locking your elbows. Maintain a straight back throughout the movement.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "BARBELL_CURL"
  },
  {
    "id": "dce0c0f8-92be-44a3-af62-9c574623579f",
    "name": "Incline Dumbbell Reverse Fly",
    "description": "Stand with a dumbbell in each hand, arms extended down at your sides. Hinge forward at the hips with a flat back and slight bend in your knees, bringing your torso close to parallel with the floor. With a slight bend in the elbows, raise your arms out to the sides in a wide arc until they reach shoulder height, squeezing your shoulder blades together at the top. Lower the dumbbells slowly and under control back to the starting position. The movement can also be performed seated on an incline bench for greater stability.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "INCLINE_DUMBBELL_REVERSE_FLY"
  },
  {
    "id": "04c8ae19-1d33-40ae-a545-dc35f3b03b75",
    "name": "Face Pull",
    "description": "Set the cable pulley to a high position and attach a rope handle. Stand facing the machine and grab each end of the rope with a neutral grip, thumbs pointing toward you. Step back slightly and extend your arms forward, keeping a slight bend in your elbows. Pull the rope toward your face by driving your elbows back and out while squeezing your shoulder blades together. At the end of the movement, your elbows should be at shoulder height, and your forearms should form a 90-degree angle, with the rope spread apart near your face. Reverse the motion slowly to return to the starting position, keeping tension on the cable at all times.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "FACE_PULL"
  },
  {
    "id": "232fcb78-53e6-4811-b490-c075b9e9fc1b",
    "name": "Reverse Butterfly",
    "description": "Sit facing the rear side of the butterfly (pec deck) machine and adjust the seat so that your shoulders are aligned with the handles. Grab the handles with a neutral grip and keep your elbows slightly bent. Pull the handles outward and backward in a wide arc, focusing on squeezing your shoulder blades together at the peak of the movement. Keep your chest in contact with the pad and avoid using momentum. Slowly return the handles to the starting position under control to complete the rep.",
    "muscleGroup": "Shoulders",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "REVERSE_BUTTERFLY"
  },
  {
    "id": "c2410039-1cc4-4786-80bd-bf73a1cc0989",
    "name": "Dumbbell Hammer Grip Curl",
    "description": "Stand upright with a dumbbell in each hand, arms extended at your sides and palms facing your body in a neutral grip. Keep your elbows close to your torso and maintain a straight back. Curl the dumbbells upward by bending your elbows, bringing the weights toward your shoulders while keeping the palms facing inward throughout the movement. Squeeze your biceps at the top, then lower the dumbbells slowly and under control back to the starting position without locking your elbows. This exercise can also be performed seated on a bench.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_HAMMER_GRIP_CURL"
  },
  {
    "id": "1a83a7c1-dcb2-450b-8635-45995419ead3",
    "name": "Biceps Curl Machine",
    "description": "Adjust the seat height so your upper arms rest comfortably on the arm pad, with your elbows aligned with the machine’s pivot point. Grasp the handles or bar with an underhand grip. Keeping your upper arms fixed against the pad, curl the weight toward your shoulders by bending your elbows and contracting your biceps. Pause briefly at the top, then lower the weight slowly back to the starting position without fully locking your elbows. Maintain smooth and controlled movement throughout the exercise.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "BICEPS_CURL_MACHINE"
  },
  {
    "id": "189f06ce-580c-46e2-91b5-21b010f6ef67",
    "name": "Reverse Barbell Curl",
    "description": "Stand upright holding a barbell with both hands using an overhand (pronated) grip, palms facing down, and hands at shoulder-width. Keep your elbows close to your body and your arms fully extended in front of your thighs. Curl the barbell upward by bending your elbows, bringing the bar toward your shoulders while keeping your upper arms stationary. Focus on contracting your forearms and biceps. Lower the bar slowly and under control back to the starting position, without locking your elbows. Maintain a straight posture throughout the movement.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "REVERSE_BARBELL_CURL"
  },
  {
    "id": "8855bcea-babe-445e-a378-7d7df2fe0f32",
    "name": "Biceps Cable Curl",
    "description": "Stand facing a low cable pulley with a straight bar attachment. Grab the bar with an underhand grip, hands about shoulder-width apart, and arms fully extended in front of your thighs. Keep your elbows close to your torso and curl the bar upward by bending your elbows, bringing the bar toward your shoulders. Contract your biceps at the top of the movement. Slowly lower the bar back down to the starting position, maintaining control and avoiding full elbow lockout.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "BICEPS_CABLE_CURL"
  },
  {
    "id": "046bd521-311e-4d29-9690-b55bf7682ec6",
    "name": "High Cable Curls",
    "description": "Stand in the center of a cable crossover machine with both pulleys set at the highest position. Grab a handle in each hand using a supinated grip, and extend your arms out to the sides at shoulder height without locking your elbows. Keep your upper arms parallel to the floor and stationary. Curl the handles toward your head by bending your elbows and contracting your biceps. Pause briefly at the peak of the movement, then slowly return to the starting position while maintaining tension in the cables.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "HIGH_CABLE_CURLS"
  },
  {
    "id": "e809c52c-650d-4c25-b1e4-6a719a4202d7",
    "name": "Spider Curl",
    "description": "Lie face down on an incline bench with your chest supported and your arms hanging straight down, holding a dumbbell in each hand with your palms facing forward. Keep your upper arms vertical and stationary. Curl the weights toward your shoulders by bending your elbows and contracting your biceps. Pause briefly at the top, then lower the dumbbells slowly and under control to the starting position, without locking your elbows. This exercise can also be performed using a barbell.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "SPIDER_CURL"
  },
  {
    "id": "d12de636-6dec-4cec-b55e-27079dd8cdd6",
    "name": "Supinated Grip Pull-Ups",
    "description": "Grab a pull-up bar with an underhand (supinated) grip, palms facing you, and hands about shoulder-width apart. Start from a dead hang with arms fully extended. Engage your core and pull your chest toward the bar by bending your elbows and squeezing your shoulder blades together. Continue pulling until your chin rises above the bar. Pause briefly at the top, then lower yourself slowly back down in a controlled manner without fully locking your elbows. Keep your body stable and avoid swinging throughout the movement.",
    "muscleGroup": "Biceps",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "SUPINATED_GRIP_PULL_UPS"
  },
  {
    "id": "244b7106-7d3d-42eb-bc1a-485578d2c235",
    "name": "Dips",
    "description": "Position yourself between parallel bars, using a step or platform if needed to reach the start. Grab the bars with a neutral grip and fully extend your arms without locking the elbows. Engage your core to maintain stability. Lower your body in a controlled motion by bending your elbows until your upper arms are about parallel to the ground. Avoid letting your elbows go higher than your shoulders. Push back up to the starting position, focusing on your triceps and chest. Keep your body upright and avoid swinging throughout the movement.",
    "muscleGroup": "Chest",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "DIPS"
  },
  {
    "id": "ec96a12e-90b4-4964-80ed-e72a48158878",
    "name": "Bench Dips",
    "description": "Position yourself with your back to a flat bench and place your hands on the edge behind you, fingers pointing forward. Extend your legs in front of you with your heels on the floor and your hips elevated. Lower your body by bending your elbows until your upper arms are about parallel to the ground. Avoid letting your shoulders drop below your elbows. Push yourself back up by extending your arms, without locking the elbows at the top. Engage your core throughout to keep the movement stable.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "BENCH_DIPS"
  },
  {
    "id": "bea2a527-acdd-4a67-bc74-6ba2d7e9cb73",
    "name": "Lying Barbell Extensions",
    "description": "Sit on a flat bench with a barbell resting on your thighs, gripping it with a narrow overhand grip. Lie back on the bench and extend your arms fully so the barbell is directly above your chest, perpendicular to your torso. Keeping your elbows tucked in and stationary, lower the barbell toward your forehead by bending only at the elbows. Once the bar is close to your forehead, extend your arms back up to the starting position without locking the elbows. Only your forearms should move throughout the exercise.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "LYING_BARBELL_EXTENSIONS"
  },
  {
    "id": "446784b8-1e8e-41c4-a06f-aa6fa0743bbb",
    "name": "Close Grip Chest Press",
    "description": "Sit on a flat bench with a barbell resting on your thighs, and grip it with a close overhand grip, palms facing down. Lie back and press the barbell straight up so your arms are fully extended above your chest. Keep your elbows close to your torso and lower the barbell down in a controlled motion until it touches or nearly touches your mid-chest. Press the bar back up to the starting position by extending your arms, without locking your elbows. Focus on keeping tension on the triceps throughout the movement.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "CLOSE_GRIP_CHEST_PRESS"
  },
  {
    "id": "d1625a78-9eae-4e2d-b3aa-81c33ac33bc8",
    "name": "Dumbbell Overhead Triceps Extension",
    "description": "Sit on a bench with back support, holding a single dumbbell with both hands. Grip the dumbbell by the upper end with your palms facing the weight plate for stability. Extend your arms overhead, keeping the dumbbell positioned above your head. Slowly bend your elbows to lower the weight behind your head, making sure your upper arms remain stationary and close to your ears. Do not allow the dumbbell to touch your neck. Once you reach a deep stretch, extend your arms again to return to the starting position. Keep your back straight and only move your forearms throughout the exercise.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_OVERHEAD_TRICEPS_EXTENSION"
  },
  {
    "id": "7a6f9920-7d58-476d-8c34-9508b20d4dc6",
    "name": "Barbell Bench Press",
    "description": "Lie flat on a bench with your feet firmly planted on the floor. Grip the barbell slightly wider than shoulder-width, keeping your wrists aligned over your elbows. Unrack the bar and position it above your chest. Lower the bar under control by bending your elbows, bringing it down to your mid-chest while keeping your elbows at about a 45-degree angle from your torso. Press the bar upward until your arms are extended, without locking your elbows. Maintain symmetry between both arms and avoid excessive arching of your lower back. At the end of your set, carefully rerack the bar.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "BARBELL_BENCH_PRESS"
  },
  {
    "id": "08833b02-e25d-4dda-8fdd-e81ad171107c",
    "name": "Dumbbell Kickback",
    "description": "Place one knee and the same-side hand on a flat bench for support, keeping your back straight and head in a neutral position. Hold a dumbbell in the opposite hand with your arm bent and upper arm parallel to your torso. Extend your arm fully by straightening the elbow until the dumbbell points backward. Keep your upper arm stationary and close to your body throughout. Squeeze your triceps at the top, then slowly return to the starting position without letting your elbow drop. Perform the desired reps and switch sides.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_KICKBACK"
  },
  {
    "id": "427f803e-13ae-4994-82fe-fec9a8440a18",
    "name": "Rope Triceps Extension",
    "description": "Attach a rope handle to a high pulley and stand facing the cable machine. Grab the rope with a neutral grip, elbows tucked close to your body and forearms parallel to the floor. Extend your arms downward, pushing the rope toward your thighs while slightly separating the ends of the rope at the bottom of the movement. Contract your triceps at the end, then slowly return to the starting position by bending your elbows. Only your forearms should move during the exercise.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "ROPE_TRICEPS_EXTENSION"
  },
  {
    "id": "bca9220b-bdb7-4b7d-803f-4c3ff0f05cc4",
    "name": "Overhead Triceps Extension",
    "description": "Attach a rope handle to a high pulley and stand facing away from the machine. Grab the rope with a neutral grip and bring your hands behind your head with your elbows bent and pointing forward. Take a small step forward and lean slightly. Extend your arms fully in front of you, pushing the rope forward and upward until your arms are straight. Focus on keeping your elbows in position. Slowly return to the starting position by bending your elbows. Keep your back straight and only move your forearms during the exercise.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "OVERHEAD_TRICEPS_EXTENSION"
  },
  {
    "id": "3232d389-cf66-4eaf-bb77-b63fa7cd34fd",
    "name": "Close Grip Push-Ups",
    "description": "Get into a kneeling position and place your hands on the floor close together, just under your chest. Extend your legs back to form a plank, resting on the balls of your feet. Keep your body straight and engage your core. Lower your chest toward the floor by bending your elbows while keeping them close to your torso. Avoid letting your elbows flare out. Once your chest is just above the ground, push through your palms to return to the starting position. Maintain a straight back and controlled motion throughout.",
    "muscleGroup": "Triceps",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "CLOSE_GRIP_PUSH-UPS"
  },
  {
    "id": "5fcb938e-a4fa-4c9c-9f59-77e3ab1dfe98",
    "name": "Incline Barbell Bench Press",
    "description": "Lie back on an incline bench, with your feet firmly planted on the floor. Grip the barbell slightly wider than shoulder-width. Unrack the bar and position it directly above your upper chest. Lower the bar under control by bending your elbows, bringing it to the upper portion of your chest. Press the bar back upward by extending your arms, stopping just before locking your elbows. Keep your back flat against the bench, maintain symmetry, and avoid excessive arching. Rerack the bar safely after completing your set.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "INCLINE_BARBELL_BENCH_PRESS"
  },
  {
    "id": "b9b45b9f-49ef-41ce-b038-3cba517aa275",
    "name": "Decline Barbell Bench Press",
    "description": "Lie back on a decline bench with your feet secured under the foot pads and your back firmly supported. Grip the barbell slightly wider than shoulder-width. Unrack the bar and position it over your lower chest. Lower the bar slowly and under control by bending your elbows, keeping them at a slight angle from your torso. Press the bar back up by extending your arms until they are almost straight, without locking the elbows. Focus on maintaining symmetry, keeping your back stable, and returning the bar safely to the rack after your set.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DECLINE_BARBELL_BENCH_PRESS"
  },
  {
    "id": "a71513f6-144b-4ede-8005-415bc940da24",
    "name": "Dumbbell Bench Press",
    "description": "Sit on a flat bench with a dumbbell in each hand, using a neutral or standard grip. Lie back with your feet firmly planted on the floor and bring the dumbbells to chest level. Press the weights upward until your arms are nearly extended, allowing the dumbbells to come close together at the top. Lower the dumbbells under control by bending your elbows, bringing them down to the sides of your chest according to your shoulder mobility. Press back up while keeping your arms moving in a controlled arc. Do not lock out the elbows. Keep your back flat on the bench and ensure even movement on both sides.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_BENCH_PRESS"
  },
  {
    "id": "2fc1dcb9-7da7-48ab-af13-66f8fd2889ce",
    "name": "Incline Dumbbell Bench Press",
    "description": "Sit on an incline bench with a dumbbell in each hand, using a neutral or standard grip. Lie back with your feet firmly planted on the floor and position the dumbbells at chest level. Press the dumbbells upward at a slight angle until your arms are almost fully extended, bringing the weights close together at the top. Slowly lower them under control by bending your elbows, allowing the dumbbells to descend toward the upper chest. Avoid locking your elbows at the top and maintain control throughout the motion. Keep your back pressed to the bench and ensure symmetrical movement with both arms.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "INCLINE_DUMBBELL_BENCH_PRESS"
  },
  {
    "id": "9235f517-37bd-4c4d-977a-998987b48bb6",
    "name": "Decline Dumbbell Bench Press",
    "description": "Sit on a decline bench with a dumbbell in each hand using a neutral or standard grip. Lie back and secure your feet under the support pads. Bring the dumbbells to chest level and press them upward until your arms are nearly extended, bringing the weights close together at the top. Slowly lower the dumbbells in a controlled arc toward the lower chest by bending your elbows. Avoid locking your elbows at the top. Maintain control and symmetry between both arms, keep your back supported on the bench, and avoid excessive arching.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DECLINE_DUMBBELL_BENCH_PRESS"
  },
  {
    "id": "6bff0fba-9347-4053-9c10-e6eb0d4bef5c",
    "name": "Dumbbell Chest Flys",
    "description": "Sit on a flat bench with a dumbbell in each hand using a neutral grip. Lie back with your feet firmly planted on the ground and extend your arms above your chest with the dumbbells close together. Open your arms out to the sides in a wide arc, keeping a slight bend in your elbows. Lower the dumbbells until they reach approximately chest level, depending on your shoulder mobility. Engage your chest to bring the dumbbells back together over your chest in a controlled motion. Avoid locking the elbows. To emphasize the upper chest, you can use a slightly inclined bench, but too much incline will shift the focus to the shoulders.",
    "muscleGroup": "Chest",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DUMBBELL_CHEST_FLYS"
  },
  {
    "id": "de4e50a9-4d37-4f1d-9ac7-dd00822b86ca",
    "name": "Push-Ups",
    "description": "Start on all fours, placing your hands shoulder-width apart or slightly wider, and your feet extended behind you with your toes on the ground. Keep your body in a straight line from head to heels by engaging your core and glutes. Lower your chest toward the floor by bending your elbows, keeping them close to your sides. When your chest nearly touches the floor, push through your palms to extend your arms and return to the starting position. Maintain a straight spine and avoid letting your hips sag or rise throughout the movement.",
    "muscleGroup": "Chest",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "PUSH_UPS"
  },
  {
    "id": "3e9e4c94-b860-4e5f-9058-d842dade4d22",
    "name": "Pec-Deck / Butterfly",
    "description": "Adjust the seat so that your elbows are aligned with shoulder height when you grip the handles. Sit with your back firmly against the pad and your feet flat on the floor. Keep a slight bend in your elbows and bring the handles together in front of your chest by contracting your chest muscles. Pause briefly at the top, then slowly return to the starting position by opening your arms in a controlled motion. Keep the movement smooth and your back supported throughout the exercise.",
    "muscleGroup": "Chest",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "PEC_DECK"
  },
  {
    "id": "5f673aaa-0c3f-4ced-b95a-af47fffc14a5",
    "name": "Seated Chest Press",
    "description": "Adjust the seat so that the handles are aligned with the middle of your chest. Sit down with your back flat against the pad and feet firmly on the floor. Grasp the handles with elbows bent around 90 degrees. Press the handles forward by extending your arms in a controlled motion, without locking your elbows at the top. Slowly return to the starting position by bending your elbows, keeping tension on your chest muscles throughout the movement.",
    "muscleGroup": "Chest",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "SEATED_CHEST_PRESS"
  },
  {
    "id": "39abb044-2eeb-4d7b-8d02-05cb7cf0b5d5",
    "name": "High Cable Chest Fly",
    "description": "Set the pulleys to a high position and stand in the center of the machine. Grab the handles with a neutral grip and take a small step forward to create tension. With a slight bend in your elbows, open your arms wide, then bring your hands together in front of your chest by contracting your pectorals. Keep the movement slow and controlled, especially during the negative phase. Do not let the handles go too far behind you to avoid shoulder strain. You can lean slightly forward to better isolate specific areas of the chest.",
    "muscleGroup": "Chest",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "HIGH_CABLE_CHEST_FLY"
  },
  {
    "id": "bdeca3e6-15cb-4649-bf80-e642d664e5a7",
    "name": "Incline Chest Press Machine",
    "description": "Adjust the seat height so the handles align with your upper chest. Sit with your back firmly against the pad and feet flat on the floor. Grasp the handles with a firm grip and press them upward and slightly forward by extending your arms, without locking your elbows at the top. Slowly bring the handles back down in a controlled motion to return to the starting position. Keep your chest engaged and back supported throughout the movement.",
    "muscleGroup": "Chest",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "INCLINE_CHEST_PRESS_MACHINE"
  },
  {
    "id": "418bd319-fa86-4773-a172-5273d950adb3",
    "name": "Pronated Grip Pull-Ups",
    "description": "Grab the pull-up bar with an overhand (pronated) grip, hands at or slightly wider than shoulder-width apart. Engage your back muscles and pull your body upward until your chin passes the height of the bar. Focus on keeping the movement smooth and controlled. Slowly lower yourself back down without fully locking your elbows at the bottom. Keep your body tight and avoid swinging. Emphasize pulling with your back rather than relying too much on the biceps, especially in the early phase of the lift.",
    "muscleGroup": "Back",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "PRONATED_GRIP_PULL_UPS"
  },
  {
    "id": "d433e913-a6cb-457c-b071-2d2184561fb4",
    "name": "Low Cable Chest Fly",
    "description": "Set the pulleys to a low position and stand in the center of the machine. Grab the handles with a neutral grip and step slightly forward to create tension. With a slight bend in your elbows, raise your arms upward in a wide arc while bringing your hands together in front of your head, contracting your chest muscles. Pause briefly at the top, then slowly lower your arms back to the starting position in a controlled motion. Focus on keeping your chest engaged throughout the movement.",
    "muscleGroup": "Chest",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "LOW_CABLE_CHEST_FLY"
  },
  {
    "id": "de25897d-75b8-4bd3-a426-16b050bccf9b",
    "name": "Horizontal Row Machine",
    "description": "Sit facing the machine and place your feet on the supports. Bend your knees to reach the handles while keeping your back straight. Then extend your legs slightly to unlock the weight stack and create space. Retract your shoulders and squeeze your shoulder blades together as you pull the handles toward your midsection, ideally around your navel. Slowly return to the starting position with control. After completing your repetitions, bend your knees again to bring the weight stack back without rounding your back.",
    "muscleGroup": "Back",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "HORIZONTAL_ROW_MACHINE"
  },
  {
    "id": "10b040d7-a6ef-40ab-896c-faa1ff467f75",
    "name": "Barbell Bent Over Row",
    "description": "Stand with your feet shoulder-width apart and grasp the barbell with a pronated grip (palms facing down), holding it at hip level. Bend forward at the hips, keeping your back straight and chest up. Pull the bar toward your lower abdomen by retracting your shoulders and squeezing your shoulder blades together. Lower the bar in a controlled manner back to the starting position. Maintain a straight back throughout the movement. This exercise can also be performed with a supinated grip (palms facing up) to place more emphasis on the biceps.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "BARBELL_BENT_OVER_ROW"
  },
  {
    "id": "b8fadf63-943f-46c2-955a-d36adcec782b",
    "name": "Bent Over Dumbbell Row",
    "description": "Stand with a dumbbell in each hand, arms hanging at your sides. Slightly bend your knees and hinge forward at the hips while keeping your back straight and chest up. Pull the dumbbells toward your hips by retracting your shoulders and squeezing your shoulder blades together. Lower the weights in a controlled motion until your arms are nearly fully extended. Focus on using your back muscles and minimize biceps involvement to better isolate the upper and mid-back.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "BENT_OVER_DUMBBELL_ROW"
  },
  {
    "id": "1c6a479f-b59e-47e3-bd6b-e746ecbee601",
    "name": "Pull-Down",
    "description": "Sit on the seat facing the machine and grasp the bar with a pronated grip (palms facing away), hands shoulder-width or slightly wider. Engage your lats to pull the bar down toward your upper chest, keeping your torso upright. Pause briefly at the bottom, then slowly return to the starting position without locking out your elbows. Focus on controlling the negative phase of the movement. This exercise can also be performed with a supinated grip (palms facing you) for increased biceps activation.",
    "muscleGroup": "Back",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "PULL_DOWN"
  },
  {
    "id": "0834c776-97f9-44e5-afc5-139f05a580f8",
    "name": "Unilateral Bent Over Row",
    "description": "Place one knee and the same-side hand on a flat bench to support your body, ensuring your back remains flat and parallel to the ground. With your free hand, grab a dumbbell and pull it up toward your hip by retracting your shoulder and squeezing your shoulder blade. Pause briefly at the top, then lower the dumbbell under control until your arm is nearly fully extended. Focus on using your back muscles rather than the biceps. After completing one side, switch and perform the movement on the other arm.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "UNILATERAL_BENT_OVER_ROW"
  },
  {
    "id": "6bbb19ad-cdb3-46ee-80fe-c23dc3b05eb1",
    "name": "Back extensions",
    "description": "Position yourself on the back extension machine, securing your feet and adjusting the pad so it rests just below your hips. Start with your upper body straight in line with your legs. Lower your torso by hinging at the hips, keeping your back flat and descending as far as your mobility allows. Reverse the movement by contracting your lower back muscles to raise your torso until your body is straight again, avoiding hyperextension. To increase difficulty, you can hold a weight plate against your chest.",
    "muscleGroup": "Back",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "BACK_EXTENSIONS"
  },
  {
    "id": "bf08a85a-aa3a-4242-895c-a9025a99a284",
    "name": "Pullover",
    "description": "Place a dumbbell on your knees while sitting on the bench. Lie back and bring the dumbbell above your chest, holding it with both palms against the inside of the weight plate for better control. Extend your arms slightly bent and pivot the shoulders backward to lower the dumbbell behind your head. Engage your lats to bring the weight back above your chest and repeat. Maintain a strong grip on the weight to avoid injury. This exercise can also be performed with a barbell.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "PULLOVER"
  },
  {
    "id": "21c37b13-51b8-4590-bf7b-4ec9a45d53a7",
    "name": "Plank",
    "description": "Kneel down, then place your elbows on the mat and extend your legs to distribute your weight between your toes and forearms. Your back should remain straight throughout the hold. Contract your abs to maintain this position for the set duration, then relax.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "PLANK"
  },
  {
    "id": "0ee686db-2fc7-4f69-b154-f59d1f3d2f84",
    "name": "Australian Pull-Ups",
    "description": "Set the bar at a height that allows you to grip it while keeping your heels on the ground. Grab the bar with an overhand grip (palms facing away from you), hands shoulder-width apart or slightly wider. Engage your shoulder blades to pull your chest toward the bar while keeping your body straight and core tight. Lower yourself in a controlled manner without locking out the elbows at the bottom. Focus on using your back muscles throughout the movement and avoid relying on the biceps too early in the pull.",
    "muscleGroup": "Back",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "AUSTRALIAN_PULL_UPS"
  },
  {
    "id": "50dfce16-5d45-4f12-9928-5730fc027689",
    "name": "T-Bar Row",
    "description": "Stand over the T-bar with your feet shoulder-width apart. Bend your knees slightly and hinge forward at the hips while keeping your back flat and chest up. Grab the handles with either a pronated or neutral grip, depending on the handle type. Pull the bar toward your torso by retracting your shoulder blades and driving your elbows back. Squeeze your back at the top, then lower the weight under control without locking your arms at the bottom. Focus on using your back muscles and limit biceps involvement early in the pull.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "T_BAR_ROW"
  },
  {
    "id": "e7c2ba66-ff0a-4d9e-ba49-5ed54e411467",
    "name": "Deadlift",
    "description": "Stand with your feet shoulder-width apart, the barbell positioned over the middle of your feet. Bend at the hips and knees while keeping your back flat and chest up. Grab the bar with a pronated grip (palms facing you) and engage your lats by pulling your shoulders back. Push through your heels to lift the bar, extending your hips and knees simultaneously until you're standing upright. Pause briefly at the top without leaning back. Lower the bar in a controlled motion by hinging at the hips and bending your knees, keeping your back straight throughout the descent.",
    "muscleGroup": "Back",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "DEADLIFT"
  },
  {
    "id": "21c04a87-a1a5-4d5d-9281-5ad226fb67e7",
    "name": "Pushdown straight arm",
    "description": "Stand facing the cable machine and grab the straight bar with a pronated grip (palms facing down). Step slightly back and bend your knees slightly while keeping your back straight. With arms fully extended but not locked, use your lats to push the bar down toward your thighs, maintaining your arms straight throughout the motion. Once at the bottom, slowly return the bar to the starting position in a controlled manner. Keep your back straight and core engaged at all times.",
    "muscleGroup": "Back",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "PUSHDOWN_STRAIGHT_ARM"
  },
  {
    "id": "1da82d9e-159a-4100-ba47-bf51b8ca46f0",
    "name": "Low cable row",
    "description": "Stand or sit facing the low pulley machine and grab the handle with a pronated grip (palms facing down). Keep your back straight and chest up as you pull the handle toward your torso, focusing on squeezing your shoulder blades together. Pause briefly at the top, then slowly return to the starting position with control. You may also perform this exercise with a supinated grip (palms facing up) for more biceps engagement, or unilaterally to isolate each side.",
    "muscleGroup": "Back",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "LOW_CABLE_ROW"
  },
  {
    "id": "b1f27510-a952-4227-a104-a6a3b7c21313",
    "name": "TRX row",
    "description": "Grab the two handles with a neutral grip and lean back while keeping your arms and legs extended but not locked. Pull your chest toward the handles by bending your elbows and keeping them close to your body. Control the descent back to the starting position. Maintain a straight body line throughout the movement. You can increase or decrease the difficulty by adjusting your foot placement and the height of the handles. Changing your grip (pronated or supinated) also helps target different muscle fibers.",
    "muscleGroup": "Back",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "TRX_ROW"
  },
  {
    "id": "87680ca6-38b0-4db1-9460-244c883816a0",
    "name": "Crunches",
    "description": "Lie on your back on a mat with your knees bent. Place your hands at your temples or cross your arms over your chest. Contract your abdominal muscles to lift your upper body off the floor, keeping your lower back pressed against the mat at all times. Return to the starting position and repeat.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "CRUNCHES"
  },
  {
    "id": "7c8bf962-f791-48bd-994c-999809cdfc00",
    "name": "Rotation crunches",
    "description": "Lie on your back on a mat with your knees bent. Place your hands at your temples and cross one leg over the other by placing your ankle on the opposite knee. Contract your abs while slightly rotating your torso to bring your elbow toward the crossed leg. Return to the starting position and repeat with the opposite leg. Keep your lower back pressed against the mat throughout the exercise.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "ROTATION_CRUNCHES"
  },
  {
    "id": "15c20cbb-254d-4496-840e-01c36cf60ef3",
    "name": "Leg raises",
    "description": "Lie on your back on a mat with your arms at your sides and your legs straight or slightly bent. Contract your abs to lift your legs up to about a 90° angle, then control the descent back to the starting position, stopping just before your feet touch the ground to maximize muscle engagement. Keep your lower back pressed against the mat throughout the exercise.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "LEG_RAISES"
  },
  {
    "id": "620f989d-ace5-4e43-bb11-363515753047",
    "name": "Lateral plank",
    "description": "Kneel down and place one of your elbows on the mat, then extend your legs on the opposite side to distribute your weight between one foot and the active forearm. You will be positioned sideways to engage the oblique muscle. Your back should remain straight throughout the hold. Contract your abs to maintain this position for the set duration, then relax. Repeat on the other side.",
    "muscleGroup": "Obliques",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "LATERAL_PLANK"
  },
  {
    "id": "a5c9db8f-88bf-43af-b6ef-eba58e466ce9",
    "name": "Mountain climbers",
    "description": "Kneel down and place your hands flat on the mat, then extend your legs. Bend one knee to bring it toward your chest. At that moment, extend that same leg back to the starting position while bending the opposite knee. Repeat this cycle at a fast pace to work on your cardio. Remember to contract your abs throughout the movement.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "MOUNTAIN_CLIMBERS"
  },
  {
    "id": "32c95cca-ab36-4164-abc6-a6408eeab2b8",
    "name": "Russian twist",
    "description": "Sit on a mat with your knees bent and your hands joined in front of you. Slightly lift both feet off the floor, and rotate your torso to bring your hands to one side of your body while keeping them together. Do the same on the opposite side and continue. Keep your abs engaged to optimize core work and maintain posture and balance.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "RUSSIAN_TWIST"
  },
  {
    "id": "1fbcc41d-2fe1-4966-991c-c752ff19fe5e",
    "name": "Cable crunches",
    "description": "Attach a rope to a high pulley and kneel facing it. Grab the rope with both hands in a neutral grip (palms facing inward), keeping your back straight at the start. Contract your abs to round your back forward, keeping the ends of the rope near your ears. Once you've reached maximum contraction, return to the starting position slowly to optimize muscle engagement. Avoid going too low to prevent engaging the hip flexors and focus on the abs.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Cable"
    ],
    "exerciseCode": "CABLE_CRUNCHES"
  },
  {
    "id": "e3344e08-498e-4b31-bae5-ef9e7bbf84c8",
    "name": "Squat",
    "description": "Place a bar on a rack at a suitable height. Rest the bar on your traps behind your neck, then straighten your legs to lift it off the rack. Step back slightly and position your feet shoulder-width apart or slightly wider. Keep your back straight and your abs tight, bend your knees while focusing the load on your heels to maintain balance. Imagine sitting down on a chair and keep a straight path throughout the movement. Once you reach the bottom (depth depends on your mobility), contract your quads and glutes to lift the bar back up. After your set, carefully rack the bar. Always keep your back straight and avoid pushing your knees too far forward during the squat.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "SQUAT"
  },
  {
    "id": "82665259-66e8-418c-8a55-e631b023f244",
    "name": "V-ups",
    "description": "Lie down on a mat with your legs together and your arms by your sides. Contract your abs to raise your legs while keeping them straight, and lift your torso to try to touch your feet with your hands. The goal is to balance on your glutes during each repetition.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "V_UPS"
  },
  {
    "id": "a8a782cf-6f94-4072-a681-27afa13c5624",
    "name": "Scissors",
    "description": "Lie down on a mat with your legs together and your arms along your sides. Slightly lift both legs off the ground, then raise one leg while keeping it straight, as the other remains close to the floor. Lower the raised leg while lifting the other, and alternate like this throughout the set. Keep your lower back pressed into the mat during the entire movement.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "SCISSORS"
  },
  {
    "id": "1cfda8a0-7b6a-4c5b-8835-d8b8c988b186",
    "name": "Roman chair leg raises",
    "description": "Press your back against the pad and place your elbows on the armrests so that your arms are bent at 90°. With legs straight and together, bend them to raise your knees as high as possible, contracting your abs throughout the movement. While maintaining this contraction, return to the starting position with legs extended, and repeat. This exercise can also be performed with legs kept straight the entire time, which makes it harder and more effective. Always keep your back pressed against the pad during execution.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "ROMAN_CHAIR_LEG_RAISES"
  },
  {
    "id": "868fc7dc-cc48-4dad-b115-e84277e3dacb",
    "name": "Heel touches",
    "description": "Lie on a mat with your knees bent and arms along your sides. By contracting your obliques, reach to touch your heel on one side with your hand, without lifting your back off the mat. Return to the starting position and repeat on the other side. Keep your abs contracted throughout the movement to maximize muscle engagement.",
    "muscleGroup": "Obliques",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "HEEL_TOUCHES"
  },
  {
    "id": "d75a24ad-7b17-4648-8426-1ac26a423212",
    "name": "AB Wheel",
    "description": "Kneel down (preferably on a mat) and grab the AB Wheel in front of you while bending forward. Roll it as far as possible while engaging your abs until your back is straight. Hold this extended position for 2 or 3 seconds, then contract your abs to roll the wheel back to the starting position. Keep your arms and knees close together throughout the movement.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "AB_WHEEL"
  },
  {
    "id": "5eda8fe1-dcb5-4613-8bcd-1b5240e59f46",
    "name": "Hanging leg raises",
    "description": "Grab the bar with an overhand grip (palms facing away), keep your body straight and abs engaged to avoid swinging. Contract your abs to lift your legs in front of you while keeping them straight. Touch the bar with your feet (or get as close as possible), then control the descent back to the starting position. This exercise can also be performed with bent knees at 90° to make it easier.",
    "muscleGroup": "Abdominals",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "HANGING_LEG_RAISES"
  },
  {
    "id": "8f1e77dc-6219-4291-bda4-f2bbe8149a6b",
    "name": "Jump squat",
    "description": "Stand with your feet shoulder-width apart or slightly wider. Extend your arms or clasp your hands in front of you, then bend your legs to perform a squat. Go as low as your mobility allows. At the bottom of the movement, jump explosively by contracting your quadriceps, landing softly on the balls of your feet and bending your legs to absorb the impact. Keep your back straight throughout the movement.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "JUMP_SQUAT"
  },
  {
    "id": "611a0d2a-eee4-41bf-8371-5899e1d64f26",
    "name": "Lunges",
    "description": "Stand with your feet hip-width apart. Step forward and bend the front leg until it forms a 90° angle, keeping your torso upright. Your rear leg should be supported on the ball of the foot, parallel to the ground. Push through the front leg to return to the starting position. You can continue alternating legs or perform all reps on one side. Keep your back straight and avoid letting your knees go too far forward during the lunge.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight",
      "Free weight"
    ],
    "exerciseCode": "LUNGES"
  },
  {
    "id": "694d26e0-6b81-4a4d-90ea-6260f07c217f",
    "name": "Hack squat",
    "description": "Step onto the platform with your back pressed firmly against the backrest and position yourself between the shoulder pads. Place your feet shoulder-width apart on the platform, adjusting their position depending on the muscle focus. Unlock the sled using the handles and extend your legs without locking your knees to engage the weight. Bend your knees to lower the sled in a controlled motion, stopping as low as your mobility allows. Once at the bottom, contract your quads and glutes to push the sled back to the starting position. Keep your back in contact with the pad at all times, maintain an upright torso, and avoid locking your knees at the top.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "HACK_SQUAT"
  },
  {
    "id": "e603c228-701b-4239-ada5-14b6b09fa628",
    "name": "Burpees",
    "description": "Stand with your feet shoulder-width apart or slightly wider. Bend your knees to perform a squat and place your hands on the ground at the bottom of the movement. While crouching, support your weight with your arms and kick your legs back to get into a plank position. Perform a push-up while keeping your body tight and your back straight. Then bring your feet back to your hands, returning to the bottom of a squat. Explosively jump up by contracting your quads and raising your arms for momentum. Land softly on your toes with bent knees to absorb the impact. Continue immediately by squatting again.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "BURPEES"
  },
  {
    "id": "b2fba2d4-0cf3-491b-ab2f-c8fd4b58879f",
    "name": "Pistol squat",
    "description": "Stand upright with your arms down at your sides. While balancing on one leg, perform a squat, going as low as your mobility allows. As you descend, extend your arms in front of you to help distribute your weight and maintain alignment. At the bottom, contract your quadriceps to return to the starting position, then repeat with the opposite leg. Make sure not to let your knee move too far forward during the descent.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "PISTOL_SQUAT"
  },
  {
    "id": "03b63fcb-3634-423c-80de-98eab4e55027",
    "name": "Front Squat",
    "description": "Set a barbell on a rack at a height that suits you. Rest the bar on the front of your shoulders and grip it with your palms facing up (you can also cross your arms over the bar to reduce wrist strain). Stand up to lift the bar off the rack. Step back slightly and position your feet shoulder-width apart or a bit wider. With your back straight and abs tight, bend your knees, keeping your weight on your heels for balance. Lower yourself as if sitting in a chair, maintaining a straight movement path. Once you reach the bottom (depth depending on your mobility), contract your quads and glutes to return to the starting position. After your set, re-rack the bar. Always keep your back straight and avoid pushing your knees too far forward.",
    "muscleGroup": "Quadriceps",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "FRONT_SQUAT"
  },
  {
    "id": "c5c22898-23f4-4156-86d3-bda2177adae2",
    "name": "Leg extension",
    "description": "Sit on the machine with your back flat against the pad. Place your feet under the pad so that it rests near your ankles. Contract your quadriceps to lift the pad, extending your legs fully. Then, control the descent back to the starting position and repeat. This exercise can also be performed unilaterally, one leg at a time.",
    "muscleGroup": "Quadriceps",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "LEG_EXTENSION"
  },
  {
    "id": "31eb74fc-e71e-48aa-884e-89efda1860ab",
    "name": "Jumping Jacks",
    "description": "Stand upright with your feet shoulder-width apart and your arms at your sides. Jump and spread your legs wider while raising your arms to the sides until your hands meet above your head. Jump again to return to the starting position, lowering your arms back to your sides and bringing your feet back to shoulder-width. Keep your posture upright throughout the movement.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "JUMPING_JACKS"
  },
  {
    "id": "a8f68237-a6d3-4f0b-a77c-262f67177a92",
    "name": "Jumping lunges",
    "description": "Stand with your feet hip-width apart. Step forward and bend the front leg to form a 90° angle, keeping your torso upright. Your back leg should be on the ball of the foot, parallel to the ground. Explosively push off the front leg to jump and switch legs mid-air, landing with the opposite leg forward. Land softly on the balls of your feet and bend your knees to absorb the impact. Repeat by alternating legs. Keep your back straight and avoid pushing your knees too far forward.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "JUMPING_LUNGES"
  },
  {
    "id": "d9850407-2961-4932-bd1b-679ccd3de7e2",
    "name": "Standing calf raises",
    "description": "Stand facing the machine with the balls of your feet on the edge of the platform. Adjust the shoulder pads to rest on your shoulders. With legs straight and back upright, raise your heels by contracting your calves to stand on your tiptoes. Then lower your heels slowly to return to the starting position.",
    "muscleGroup": "Calves",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "STANDING_CALF_RAISES"
  },
  {
    "id": "c3589fc0-c93f-4d8a-9982-ff5cc1405153",
    "name": "Calf press leg press",
    "description": "Sit with your back firmly against the backrest. Place the balls of your feet on the lower part of the platform, shoulder-width apart. Unlock the press using the handles, then extend your legs without locking your knees. Push through your calves to raise your heels and lift onto the balls of your feet. Slowly lower your heels to return to the starting position. Make sure to keep your back and glutes in contact with the seat at all times.",
    "muscleGroup": "Calves",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "CALF_PRESS_LEG_PRESS"
  },
  {
    "id": "85bddde0-fd5a-44dc-9ad0-7d11480df59f",
    "name": "Leg press",
    "description": "Sit down with your back pressed firmly against the backrest. Place your feet shoulder-width apart on the platform, positioning them higher or lower depending on the muscle focus. Unlock the press using the handles, then extend your legs without locking your knees to release the weight. Bend your legs to lower the platform in a controlled manner, going as low as your mobility allows. Once at the bottom, contract your quads and glutes to push the platform back to the starting position. Keep your back and glutes in contact with the seat at all times, and avoid locking your knees when extending your legs.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "LEG_PRESS"
  },
  {
    "id": "803823cf-5031-426d-b88b-1a5b6e86bee0",
    "name": "Wall sit",
    "description": "Stand with your back against a wall, feet shoulder-width apart or slightly wider. Lower yourself by bending your knees until they form a 90-degree angle. Rest your hands on your thighs or against the wall. Engage your thighs and hold this position for the desired duration, focusing your weight on your heels. Keep your back pressed firmly against the wall throughout the exercise.",
    "muscleGroup": "Quadriceps",
    "equipment": [
      "Body weight"
    ],
    "exerciseCode": "WALL_SIT"
  },
  {
    "id": "d1420150-c118-46dd-adf4-8f6ac314e475",
    "name": "Goblet squat",
    "description": "Stand with your feet shoulder-width apart or slightly wider. Grab a dumbbell vertically with your palms facing the plate, and bring it up to chest level with your elbows bent. Keep your back straight and your core tight. Bend your knees and push your hips back as if sitting in a chair, keeping the weight centered over your heels. Descend as low as your mobility allows, then contract your quads and glutes to return to the starting position. Make sure to keep your back straight and avoid letting your knees move too far forward.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "GOBLET_SQUAT"
  },
  {
    "id": "99148772-f963-47bc-8657-087f1b468a71",
    "name": "Stiff leg deadlift",
    "description": "Stand in front of the barbell placed on the floor. Bend forward while keeping your back straight and legs slightly bent to grasp the bar with a pronated grip (palms facing you). Engage your lower back to lift your torso up, keeping your legs nearly straight. Pause briefly at the top, then lower the bar back to the floor while keeping your back straight. Keep your shoulders pulled back throughout the movement.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "STIFF_LEG_DEADLIFT"
  },
  {
    "id": "c36825d7-4520-4ca0-960a-f97b3ac7d4c8",
    "name": "Kettlebell swing",
    "description": "Stand with your feet shoulder-width apart or slightly wider. Bend your knees and hinge at the hips while keeping your back straight to grab the kettlebell with both hands. Initiate a slight swing with your hips and push with your legs to drive the kettlebell upward in front of you with straight arms, ideally until it's at eye level. Your arms should merely guide the movement, with minimal effort. Once at the top, control the descent, allowing the kettlebell to swing between your legs, then use your hips to continue the motion. Keep your back straight throughout the movement. If you're comfortable, you can swing the kettlebell overhead.",
    "muscleGroup": "Glutes",
    "equipment": [
      "Free weight"
    ],
    "exerciseCode": "KETTLEBELL_SWING"
  },
  {
    "id": "1b7bdb28-1d3a-4b38-8903-cb75b6b09a63",
    "name": "Adductor machine",
    "description": "Sit on the machine with your back pressed against the backrest. Position your legs so that the insides of your thighs and your feet rest against the pads. Squeeze your legs together by contracting your adductors, then slowly control the return to the starting position.",
    "muscleGroup": "Adductors",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "ADDUCTOR_MACHINE"
  },
  {
    "id": "adf9f5eb-719c-4de5-9d95-00873cb6ae19",
    "name": "Abductors machine",
    "description": "Sit on the machine with your back pressed against the backrest. Position your legs so that the outsides of your thighs and your feet rest against the pads. Push your legs outward by contracting your abductors, then slowly control the return to the starting position.",
    "muscleGroup": "Abductors",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "ABDUCTORS_MACHINE"
  },
  {
    "id": "c3769ed6-3021-4e41-859e-4682ae49e472",
    "name": "Seated calf raises",
    "description": "Sit on the machine seat and adjust the pads so they rest securely on your thighs. Unlock the weight by raising your heels using your calves, lifting onto the balls of your feet. Then lower your heels slowly back to the starting position.",
    "muscleGroup": "Calves",
    "equipment": [
      "Machine"
    ],
    "exerciseCode": "SEATED_CALF_RAISES"
  }
]